coflery/STM32F4_USB_SoundCard/usb/usbd_audio_core.c
  /* USB Speaker Audio Type III Format Interface Descriptor */
  0x0B,                                 /* bLength */
  AUDIO_INTERFACE_DESCRIPTOR_TYPE,      /* bDescriptorType */
  AUDIO_STREAMING_FORMAT_TYPE,          /* bDescriptorSubtype */
  AUDIO_FORMAT_TYPE_I,                  /* bFormatType */
  0x02,                                 /* bNrChannels */
  HALF_WORD_BYTES,                      /* XXXX bSubFrameSize : 2 Bytes per frame (16bits) */
  SAMPLE_BITS,                          /* XXXX bBitResolution (16-bits per sample) */
  0x01,                                 /* bSamFreqType only one frequency supported */
  SAMPLE_FREQ(USBD_AUDIO_FREQ),         /* XXXX Audio sampling frequency coded on 3 bytes */
  /* 11 byte*/
  
  /* Endpoint 1 - Standard Descriptor */
  AUDIO_STANDARD_ENDPOINT_DESC_SIZE,    /* bLength */
  USB_ENDPOINT_DESCRIPTOR_TYPE,         /* bDescriptorType */
  AUDIO_OUT_EP,                         /* bEndpointAddress 3 out endpoint for Audio */
  USB_ENDPOINT_TYPE_ASYNCHRONOUS,        /* USB_ENDPOINT_TYPE_ISOCHRONOUS: bmAttributes */
  AUDIO_PACKET_SZE(USBD_AUDIO_FREQ),    /* XXXX wMaxPacketSize in Bytes (Freq(Samples)*2(Stereo)*2(HalfWord)) */
  0x01,                                 /* bInterval */
  0x00,                                 /* bRefresh */
  0x00,                                 /* bSynchAddress */
  /* 09 byte*/
  
  /* Endpoint - Audio Streaming Descriptor*/
  AUDIO_STREAMING_ENDPOINT_DESC_SIZE,   /* bLength */
  AUDIO_ENDPOINT_DESCRIPTOR_TYPE,       /* bDescriptorType */
  AUDIO_ENDPOINT_GENERAL,               /* bDescriptor */
  0x00,                                 /* bmAttributes */
  0x00,                                 /* 0x00: bLockDelayUnits */
  0x00,                                 /* wLockDelay */
  0x00
  /* 07 byte*/
} ;

/**
  * @}
  */ 

/** @defgroup usbd_audio_Private_Functions
  * @{
  */ 

static uint32_t sUSBD_AUDIO_FREQ = USBD_AUDIO_FREQ;
static uint32_t sAUDIO_OUT_PACKET = AUDIO_OUT_PACKET;

void usbd_ConfigureAudio(int mode)
{
	if (mode == 0)
	{
		usbd_audio_CfgDesc[87] = HALF_WORD_BYTES;
		usbd_audio_CfgDesc[88] = SAMPLE_BITS;
		usbd_audio_CfgDesc[90] = (uint8_t)USBD_AUDIO_FREQ;
		usbd_audio_CfgDesc[91] = (uint8_t)(USBD_AUDIO_FREQ >>  8);
		usbd_audio_CfgDesc[92] = (uint8_t)(USBD_AUDIO_FREQ >> 16);
		usbd_audio_CfgDesc[97] = (uint8_t)((( USBD_AUDIO_FREQ * 2 * HALF_WORD_BYTES)/1000) & 0xFF);
		usbd_audio_CfgDesc[98] = (uint8_t)((((USBD_AUDIO_FREQ * 2 * HALF_WORD_BYTES)/1000) >> 8) & 0xFF);
		sAUDIO_OUT_PACKET = AUDIO_OUT_PACKET;
		sUSBD_AUDIO_FREQ = USBD_AUDIO_FREQ;
	}
	else
	{
		usbd_audio_CfgDesc[87] = HALF_WORD_BYTES2;
		usbd_audio_CfgDesc[88] = SAMPLE_BITS2;
		usbd_audio_CfgDesc[90] = (uint8_t)USBD_AUDIO_FREQ2;
		usbd_audio_CfgDesc[91] = (uint8_t)(USBD_AUDIO_FREQ2 >>  8);
		usbd_audio_CfgDesc[92] = (uint8_t)(USBD_AUDIO_FREQ2 >> 16);
		usbd_audio_CfgDesc[97] = (uint8_t)((( USBD_AUDIO_FREQ2 * 2 * HALF_WORD_BYTES2)/1000) & 0xFF);
		usbd_audio_CfgDesc[98] = (uint8_t)((((USBD_AUDIO_FREQ2 * 2 * HALF_WORD_BYTES2)/1000) >> 8) & 0xFF);
		sAUDIO_OUT_PACKET = AUDIO_OUT_PACKET;
		sUSBD_AUDIO_FREQ = USBD_AUDIO_FREQ2;
	}
}

/**
* @brief  usbd_audio_Init
*         Initializes the AUDIO interface.
* @param  pdev: device instance
* @param  cfgidx: Configuration index
* @retval status
*/
static uint8_t  usbd_audio_Init (void  *pdev, 
                                 uint8_t cfgidx)
{  
  /* Open EP OUT */
  DCD_EP_Open(pdev,
              AUDIO_OUT_EP,
              sAUDIO_OUT_PACKET,
              USB_OTG_EP_ISOC);

  /* Initialize the Audio output Hardware layer */
  if (AUDIO_OUT_fops.Init(sUSBD_AUDIO_FREQ, DEFAULT_VOLUME, 0) != USBD_OK)
  {
    return USBD_FAIL;
  }
    
  /* Prepare Out endpoint to receive audio data */
  DCD_EP_PrepareRx(pdev,
                   AUDIO_OUT_EP,
                   (uint8_t*)IsocOutBuff,                        
                   sAUDIO_OUT_PACKET);
  
  return USBD_OK;
}

/**
* @brief  usbd_audio_Init
*         DeInitializes the AUDIO layer.
* @param  pdev: device instance
* @param  cfgidx: Configuration index
* @retval status
*/
static uint8_t  usbd_audio_DeInit (void  *pdev, 
                                   uint8_t cfgidx)
{ 
  DCD_EP_Close (pdev , AUDIO_OUT_EP);
  
  /* DeInitialize the Audio output Hardware layer */
  if (AUDIO_OUT_fops.DeInit(0) != USBD_OK)
  {
    return USBD_FAIL;
  }
  
  return USBD_OK;
}

/**
  * @brief  usbd_audio_Setup
  *         Handles the Audio control request parsing.
  * @param  pdev: instance
  * @param  req: usb requests
  * @retval status
  */
static uint8_t  usbd_audio_Setup (void  *pdev, 
                                  USB_SETUP_REQ *req)
{
  uint16_t len=USB_AUDIO_DESC_SIZ;
  uint8_t  *pbuf=usbd_audio_CfgDesc + 18;
  
  switch (req->bmRequest & USB_REQ_TYPE_MASK)
  {
    /* AUDIO Class Requests -------------------------------*/
  case USB_REQ_TYPE_CLASS :
    if (HIBYTE(req->wIndex) == 0x2) {
        AUDIO_Req_FeatureUnit(pdev, req);
    }
    break;
    
    /* Standard Requests -------------------------------*/
  case USB_REQ_TYPE_STANDARD:
    switch (req->bRequest)
    {
    case USB_REQ_GET_DESCRIPTOR: 
      if( (req->wValue >> 8) == AUDIO_DESCRIPTOR_TYPE)
      {
#ifdef USB_OTG_HS_INTERNAL_DMA_ENABLED
        pbuf = usbd_audio_Desc;   
#else
        pbuf = usbd_audio_CfgDesc + 18;
#endif 
        len = MIN(USB_AUDIO_DESC_SIZ , req->wLength);
      }
      
      USBD_CtlSendData (pdev, 
                        pbuf,
                        len);
      break;
      
    case USB_REQ_GET_INTERFACE :
      USBD_CtlSendData (pdev,
                        (uint8_t *)&usbd_audio_AltSet,
                        1);
      break;
      
    case USB_REQ_SET_INTERFACE :
      if ((uint8_t)(req->wValue) < AUDIO_TOTAL_IF_NUM)
      {
        usbd_audio_AltSet = (uint8_t)(req->wValue);
        if ((uint8_t)(req->wIndex) == 1) {
            if ((uint8_t)(req->wValue) == 0) {
                STM_EVAL_LEDOff(LED6);
                STM_EVAL_LEDOn(LED3);
            } else if ((uint8_t)(req->wValue) == 1) {
                STM_EVAL_LEDOff(LED3);
                STM_EVAL_LEDOn(LED6);
            }
        }
      }
      else
      {
        /* Call the error management function (command will be naked) */
        USBD_CtlError (pdev, req);
      }
      break;
    }
  }
  return USBD_OK;
}

/**
  * @brief  usbd_audio_EP0_RxReady
  *         Handles audio control requests data.
  * @param  pdev: device instance
  * @retval status
  */
static uint8_t  usbd_audio_EP0_RxReady (void  *pdev)
{ 
  /* Check if an AudioControl request has been issued */
  if (AudioCtlCmd == AUDIO_REQ_SET_CUR)
  {/* In this driver, to simplify code, only SET_CUR request is managed */
    /* Check for which addressed unit the AudioControl request has been issued */
    if (AudioCtlUnit == AUDIO_OUT_STREAMING_CTRL)
    {/* In this driver, to simplify code, only one unit is managed */
        if (AudioCtlCS == AUDIO_CONTROL_VOLUME) {
            AUDIO_OUT_fops.VolumeCtl(AudioCtl[0]);
        } else if (AudioCtlCS == AUDIO_CONTROL_MUTE) {
            AUDIO_OUT_fops.MuteCtl(AudioCtl[0]);
        }
      
      /* Reset the AudioCtlCmd variable to prevent re-entering this function */
      AudioCtlCmd = 0;
      AudioCtlLen = 0;
    }
  } 
  
  return USBD_OK;
}

/**
  * @brief  usbd_audio_DataIn
  *         Handles the audio IN data stage.
  * @param  pdev: instance
  * @param  epnum: endpoint number
  * @retval status
  */
static uint8_t  usbd_audio_DataIn (void *pdev, uint8_t epnum)
{
  return USBD_OK;
}

/**
  * @brief  usbd_audio_DataOut
  *         Handles the Audio Out data stage.
  * @param  pdev: instance
  * @param  epnum: endpoint number
  * @retval status
  */
static uint8_t  usbd_audio_DataOut (void *pdev, uint8_t epnum)
{     
  if (epnum == AUDIO_OUT_EP)
  {
    /* Increment the Buffer pointer or roll it back when all buffers are full */
    if (IsocOutWrPtr >= (IsocOutBuff + (sAUDIO_OUT_PACKET * OUT_PACKET_NUM)))
    {/* All buffers are full: roll back */
      IsocOutWrPtr = IsocOutBuff;
    }
    
    /* Toggle the frame index */  
    ((USB_OTG_CORE_HANDLE*)pdev)->dev.out_ep[epnum].even_odd_frame = 
      (((USB_OTG_CORE_HANDLE*)pdev)->dev.out_ep[epnum].even_odd_frame)? 0:1;
      
    /* Prepare Out endpoint to receive next audio packet */
    DCD_EP_PrepareRx(pdev,
                     AUDIO_OUT_EP,
                     (uint8_t*)(IsocOutWrPtr),
                     sAUDIO_OUT_PACKET);

