coflery/STM32F4_USB_SoundCard/usb/usbd_audio_core.c
    /* Increment the buffer pointer */
    IsocOutWrPtr += sAUDIO_OUT_PACKET;
    
    /* Trigger the start of streaming only when half buffer is full */
    if ((PlayFlag == 0) && (IsocOutWrPtr >= (IsocOutBuff + ((sAUDIO_OUT_PACKET * OUT_PACKET_NUM) / 2))))
    {
      /* Enable start of Streaming */
      PlayFlag = 1;
    }
  }
  
  return USBD_OK;
}

/**
  * @brief  usbd_audio_SOF
  *         Handles the SOF event (data buffer update and synchronization).
  * @param  pdev: instance
  * @param  epnum: endpoint number
  * @retval status
  */
static uint8_t  usbd_audio_SOF (void *pdev)
{     
  /* Check if there are available data in stream buffer.
    In this function, a single variable (PlayFlag) is used to avoid software delays.
    The play operation must be executed as soon as possible after the SOF detection. */
  if (PlayFlag)
  {    
    /* Increment the Buffer pointer or roll it back when all buffers all full */  
    if (IsocOutRdPtr >= (IsocOutBuff + (sAUDIO_OUT_PACKET * OUT_PACKET_NUM)))
    {/* Roll back to the start of buffer */
      IsocOutRdPtr = IsocOutBuff;
    }
    /* Start playing received packet */
    AUDIO_OUT_fops.AudioCmd((uint8_t*)(IsocOutRdPtr),  /* Samples buffer pointer */
                            sAUDIO_OUT_PACKET,          /* Number of samples in Bytes */
                            AUDIO_CMD_PLAY);           /* Command to be processed */
    /* Increment to the next sub-buffer */
    IsocOutRdPtr += sAUDIO_OUT_PACKET;
    
    /* If all available buffers have been consumed, stop playing */
    if (IsocOutRdPtr == IsocOutWrPtr)
    {
      /* Pause the audio stream */
      AUDIO_OUT_fops.AudioCmd((uint8_t*)(IsocOutBuff),   /* Samples buffer pointer */
                              sAUDIO_OUT_PACKET,          /* Number of samples in Bytes */
                              AUDIO_CMD_PAUSE);          /* Command to be processed */
      
      /* Stop entering play loop */
      PlayFlag = 0;
      
      /* Reset buffer pointers */
      IsocOutRdPtr = IsocOutBuff;
      IsocOutWrPtr = IsocOutBuff;
    }
  }
  
  return USBD_OK;
}

/**
  * @brief  usbd_audio_OUT_Incplt
  *         Handles the iso out incomplete event.
  * @param  pdev: instance
  * @retval status
  */
static uint8_t  usbd_audio_OUT_Incplt (void  *pdev)
{
  return USBD_OK;
}


/******************************************************************************
     AUDIO Class requests management
******************************************************************************/
static void AUDIO_Req_FeatureUnit(void *pdev, USB_SETUP_REQ *req)
{
  uint8_t bCS = HIBYTE(req->wValue);
  uint8_t bCN = LOBYTE(req->wValue);
  
  memset(AudioCtl, 0, sizeof(AudioCtl));
  if (bCS == AUDIO_CONTROL_VOLUME && bCN == 0) {
    switch (req->bRequest) {
        case AUDIO_REQ_GET_CUR:
          AudioCtl[0] = 50;
          break;

        case AUDIO_REQ_GET_MAX:
          AudioCtl[0] = 100;
          break;
        
        case AUDIO_REQ_GET_MIN:
          AudioCtl[0] = 0;
          break;
        
        case AUDIO_REQ_GET_RES:
          AudioCtl[0] = 1;
          break;
        
        case AUDIO_REQ_SET_CUR:
          if (req->wLength)
          {
            /* Prepare the reception of the buffer over EP0 */
            USBD_CtlPrepareRx (pdev, 
                    AudioCtl,
                    req->wLength);
    
            /* Set the global variables indicating current request and its length 
            to the function usbd_audio_EP0_RxReady() which will process the request */
            AudioCtlCmd = AUDIO_REQ_SET_CUR;     /* Set the request value */
            AudioCtlLen = req->wLength;          /* Set the request data length */
            AudioCtlCS  = bCS;
            AudioCtlUnit = HIBYTE(req->wIndex);  /* Set the request target unit */
          }
          break;  

        case AUDIO_REQ_SET_MAX:
          break;
        
        case AUDIO_REQ_SET_MIN:
          break;

        case AUDIO_REQ_SET_RES:
          break;
        
        default:
          USBD_CtlError (pdev, req);
          return;
    }
  } else if (bCS == AUDIO_CONTROL_MUTE && bCN == 0) {
    switch (req->bRequest) {
        case AUDIO_REQ_GET_CUR:
          AudioCtl[0] = 0;
          break;
        case AUDIO_REQ_SET_CUR:
          if (req->wLength)
          {
            /* Prepare the reception of the buffer over EP0 */
            USBD_CtlPrepareRx (pdev, 
                    AudioCtl,
                    req->wLength);
    
            /* Set the global variables indicating current request and its length 
            to the function usbd_audio_EP0_RxReady() which will process the request */
            AudioCtlCmd = AUDIO_REQ_SET_CUR;     /* Set the request value */
            AudioCtlLen = req->wLength;          /* Set the request data length */
            AudioCtlCS  = bCS;
            AudioCtlUnit = HIBYTE(req->wIndex);  /* Set the request target unit */
          }
          break;
        
        default:
          USBD_CtlError (pdev, req);
          return;
    }
  }

  if (req->bRequest & AUDIO_REQ_GET_MASK) {
      USBD_CtlSendData (pdev, 
                        AudioCtl,
                        req->wLength);    
  }
}

/**
  * @brief  USBD_audio_GetCfgDesc 
  *         Returns configuration descriptor.
  * @param  speed : current device speed
  * @param  length : pointer data length
  * @retval pointer to descriptor buffer
  */
static uint8_t  *USBD_audio_GetCfgDesc (uint8_t speed, uint16_t *length)
{
  *length = sizeof (usbd_audio_CfgDesc);
  return usbd_audio_CfgDesc;
}

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
